{
    "title": "Software Engineer",
    "location": "North Plainfield, NJ",
    "skills": [
        { "skill": "Python", "strength": 8 },
        { "skill": "PHP", "strength": 6 },
        { "skill": "Javascript", "strength": 6 },
        { "skill": "React", "strength": 5 },
        { "skill": "NextJS", "strength": 4 },
        { "skill": "MySQL", "strength": 7 },
        { "skill": "PostgreSQL", "strength": 6 },
        { "skill": "MongoDB", "strength": 4 },
        { "skill": "Docker", "strength": 5 },
        { "skill": "Bash Scripting", "strength": 4 }
    ],
    "experience": [
        {
            "company": "Lululemon Studio/Lululemon",
            "location": "Remote",
            "position": "Senior Software Engineer",
            "tenure": "March 2021 - Present",
            "blurb": "Lululemon Studio, formerly Mirror, is a digital fitness company, running a subscription model on a digital mirror.",
            "points": [
                "Worked on the API tying together the admin site, ecomm, mobile apps, and the Mirror",
                "Improved Docker optimization",
                "Led a cross-functional team to enhance/rebuild music integration on the Mirror"
            ]
        },
        {
            "company": "Zipari",
            "location": "Brooklyn, NYC",
            "position": "Software Engineer",
            "tenure": "October 2019 - March 2021",
            "blurb": "Zipari builds a suite of tools designed to help organize and streamline health insurance, from purchasing to support.",
            "points": [
                "Built and maintained an API used to sell insurance policies",
                "Designed generic features that could be extended to fit specific clients needs",
                "Integrated with client APIs to retrieve and send data"
            ]
        },
        {
            "company": "Komodo Health",
            "location": "Manhattan, NYC",
            "position": "Senior Software Engineer",
            "tenure": "June 2019 - October 2019",
            "blurb": "Komodo Health is working to build the most complete healthcare map in the US, using various data sources and standardizing them for easier searching and data analysis.",
            "points": [
                "Worked on a team turning an internal data search tool into an external product",
                "Wrote specs for features and structured code alongside the product manager and team lead",
                "Recommend best coding practices to help two solo engineers build out better as a team"
            ]
        },
        {
            "company": "Clover Health",
            "location": "Jersey City, NJ",
            "position": "Software Engineer II",
            "tenure": "April 2018 - June 2019",
            "blurb": "Clover Health is a Medicare insurance company that utilizes member data to help predict health futures to improve outcomes.",
            "points": [
                "Built a system to receive and process messages from a remote system, including error checking and monitoring",
                "Worked on a microservice to track the state of all members in all programs at Clover",
                "Created and configured  servers and databases for the program microservice, including a bash script to deploy code",
                "Setup code standards with Black and isort"
            ]
        },
        {
            "company": "Marvel Entertainment",
            "location": "Manhattan, NYC",
            "position": "Security Engineer",
            "tenure": "July 2017 - April 2018 (Contract)",
            "blurb": "Marvel is a leading character-based entertainment company, developing comics, books, movies, games, and other media.",
            "points": [
                "Worked with DevOps to update server standards; built a Squid proxy to bump TLS1.0 requests to TLS1.2",
                "Maintained an OAuth system used to authenticate third party systems",
                "Advised the team working on the Marvel site redesign on API design, Lumen, and security"
            ]
        },
        {
            "company": "Forbes Media",
            "location": "Jersey City, NJ",
            "position": "Senior Backend Developer",
            "tenure": "August 2013 - July 2017",
            "blurb": "Forbes Media is a print and digital publishing company with international readers and writers.",
            "points": [
                "Lead developer for Forbes’ Wordpress CMS and Falcon CMS",
                "Set PHP coding standards, code reviews, and SASS/Grunt automation",
                "Worked on architecture for a new, in-house CMS",
                "Helped with interviews and communication with other department heads/overseeing project meetings when the HoD was unavailable"
            ]
        }
    ],
    "projects": [
        {
            "title": "Gamers' Plane",
            "tag": "RPG Play-by-Post Website",
            "blurb": "Gamers’ Plane is a website that runs on a PHP API drawing from a MySQL and MongoDB database, feeding an AngularJS frontend. It’s currently being refactored to use FastAPI and NextJS frontend, adding a Redis cache, powered by Docker. It is a solo project, in which I do development, design, marketing, etc, and averages about 500 users a day."
        }
    ],
    "technical_positions": [
        {
            "title": "John Wick Presents",
            "role": "Digital Consultant",
            "blurb": ""
        }
    ]
}
